                    ##   <1> Index() : 根据数据值，查找元素所在的下标，返回找到元素的下标，没有找到会报错。列表没有find方法
# 语法: list.index(数据，开始位置，结束位置)

my_list = [1,3.14,'issac',False]
num = my_list.index(3.14)
print(num)  # 1

----------------------------------------------------------------------------------------------------------------

                    ##   <2> Count() : 统计出现的次数
num2 = my_list.count(1)
print(num2) # 1
------------------------------------------------------------------------------------------------------------------

                    ##   <3> in / not in : 判断是否存在， 存在是True, 不存在是False.一般和 if else 结合使用
num3 = 3.14 in my_list # True
num4 = 3.14 not in my_list # False

----------------------------------------------------------------------------------------------------------------

